[
    {
        "section"    : "overview",
        "title"      : "",
        "paragraph"  : "The Core Modules are those which are the foundation of the framework. All the modules together provide the functionality which underpins business functionality.</p><p class=lead>However each one on their own provides key functionality that can be used in other contexts."
    },
    {
        "section"    : "modules",
        "title"      : "Terminology Query Module<br><span class='glyphicon glyphicon-ok-sign'></span>",
        "paragraph"  : "This module provides a programmatic interface which enables a consumer to interrogate the terminology using a standard query format, as well as a standard format for the response to the query. This module is exclusively used for querying against official releases of  the terminology."
    },
    {
        "section"    : "modules",
        "title"      : "Terminology Editing Module<br><span class='glyphicon glyphicon-road'></span>",
        "paragraph"  : "When authoring functionality is required, this module would be used to store changes made during the editing process. This functionality has been abstracted from querying as modifying the terminology is commonly within the context of a different set of use cases."
    },
    {
        "section"    : "modules",
        "title"      : "QA Rules Module",
        "paragraph"  : "QA Rules can exist both at the presentation layer, in the local application with the user, and also in the back end. This module represents the back end QA functionality which is a key module when editing or during the creation/modification of reference sets. It may also provide an interface for the presentation layer to surface some of the QA modules."
    },
    {
        "section"    : "modules",
        "title"      : "Identifier Management Module<br><span class='glyphicon glyphicon-ok-sign'></span>",
        "paragraph"  : "This module returns an SCTID or an array of SCTIDs upon request bearing the required data."
    },
    {
        "section"    : "modules",
        "title"      : "Release Process Module<br><span class='glyphicon glyphicon-road'></span>",
        "paragraph"  : "This module covers the necessary processes and functionality to enable a interested stakeholder to release a version of the terminology, whether this be an international version or a national extension."
    },
    {
        "section"    : "modules",
        "title"      : "Refset Services Module<br><span class='glyphicon glyphicon-road'></span>",
        "paragraph"  : "Refset functionality is covered in two areas of the OTF. This services module covers the storage and back end processing of reference sets."
    }
]
